{
    "id": 1520826,
    "name": "SiebelReview: Custom Business Component Contains No Required Fields",
    "href": "AIP/quality-rules/1520826",
    "critical": false,
    "maxWeight": 3,
    "description": "It is considered best practice to always have at least 1 required field marked in a new Business Component.  Two major issues can occur when not appropriately marking Field objects as required by the configuration:\n1. Runtime Errors \u0096 Runtime error will occur when the database column is created as NOT NULL. This will produce a runtime error because the application will not discover this requirement until the UPDATE/INSERT statement is sent to the database and the error is received.\nThe error message might be irritating for the user, since he or she cannot map the column to the field in the applet. The error message generated by the application is much more user friendly. \n2. Data integrity may be affected when required fields do not get populated (in cases when the column does not require NOT NULL values).",
    "output": "This rule reports Business Components without any required field",
    "rationale": "Custom business components were created but none of the fields are set to be required through the use of the \"Required\" property on the Field object.",
    "remediation": "It is best practice to always configure at least 1 field as required for a Business Component.  Fields referencing columns that are defined as NOT NULL should definitely be marked as \"Required\" in order to prevent the low-level error message described above.  When the field is marked appropriately as required then the application will present the user with a higher-level user-friendly message that simply states the field is required.",
    "total": "Number of added or modified Business Components",
    "alternativeName": "SiebelReview: Custom Business Component Contains No Required Fields",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66062,
            "name": "Secure Coding - Input Validation",
            "weight": 3,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1520000,
            "name": "Siebel",
            "href": "AIP/technologies/1520000"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        50.0,
        70.0,
        80.0,
        99.0
    ]
}
