{
    "id": 1520112,
    "name": "SiebelReview: Missing Join Specification for Custom Joins",
    "href": "AIP/quality-rules/1520112",
    "critical": false,
    "maxWeight": 4,
    "description": "Join specifications provide the relationship information needed to connect two tables when an SQL statement is generated at run time.\nIf no join specification is provided, but columns from the joined table are used in the BusComp, the table will be included in the FROM statement using the default join of TABLE1.ROW_ID = TABLE2.ROW_ID.\nWith the exception of an extension table, where the ROW_ID of the extension table is generally the same as that of the parent table, this join will never return a match.\n* For an inner join, no rows will be returned.\n* For an outer join, a row will be returned from the parent table, but no child record will ever be returned.",
    "output": "This rule reports all Joins without specification",
    "rationale": "Joins configured without setting the relevant join specification have been found in the supplied repository.  These joins have at least one field associated to them.",
    "remediation": "Ensure that an appropriate Join Specification exists using a field based on a foreign key field in the current BusComp and a corresponding column in the destination table.",
    "total": "Number of added or modified Joins",
    "alternativeName": "SiebelReview: Missing Join Specification for Custom Joins",
    "businessCriteria": [
        {
            "id": 66032,
            "name": "Architectural Design",
            "href": "AIP/business-criteria/66032"
        },
        {
            "id": 60012,
            "name": "Changeability",
            "href": "AIP/business-criteria/60012"
        },
        {
            "id": 60013,
            "name": "Robustness",
            "href": "AIP/business-criteria/60013"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 61001,
            "name": "Architecture - Multi-Layers and Data Access",
            "weight": 4,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1520000,
            "name": "Siebel",
            "href": "AIP/technologies/1520000"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        60.0,
        80.0,
        95.0,
        100.0
    ]
}
