{
    "id": 1520822,
    "name": "SiebelReview: View Visibility Settings",
    "href": "AIP/quality-rules/1520822",
    "critical": false,
    "maxWeight": 6,
    "associatedValueName": "Reason for violation (1 of 3 cases)",
    "description": "Incorrectly configured visibility settings will affect the display of records within the view. \nIf both of these properties are not set correctly or are missing, then the view will either inherit visibility from the previous view (if there is one) or default to the most restrictive visibility type for the driving BC. \n\nIf the Visibility Applet Type is defined but the Visibility Applet is not, then the application will ignore the visibility settings since it cannot determine on which business component data to restrict the visibility.\nIn some cases Visibility Applet is wrongly set to an applet that doesn't exists in the current view.",
    "output": "This rule reports Applets having the \"Visibility Applet Type\" and/or \"Visibility Applet\" properties incorrectly configured",
    "rationale": "Some views have the \"Visibility Applet Type\" and/or \"Visibility Applet\" properties incorrectly configured.",
    "remediation": "For list views, set the \"Visibility Applet\" to the driving applet of the view, typically the parent applet in the view, and set the appropriate \"Visibility Applet Type\".\nFor detail views and Admin views (Admin flag should be set), visibility should not apply to the view, or it should be inherited from another view.\nFor these views, clear the Visibility and Visibility Applet Type property from the view.\nAlso, if you want the view to appear in the \"Show\" Combo box then simply configure the Visibility Applet property of the view.\nCheck all views and set to NULL Visibility Applet properties in detail views or set it to the needed value in the master views of BC's:\n\nFor more information on the setting of these properties, please refer to the Siebel Tools Guide within Siebel Bookshelf.",
    "total": "Number of added or modified Views with a Visibility Applet",
    "alternativeName": "SiebelReview: View Visibility Settings",
    "businessCriteria": [
        {
            "id": 66031,
            "name": "Programming Practices",
            "href": "AIP/business-criteria/66031"
        },
        {
            "id": 60016,
            "name": "Security",
            "href": "AIP/business-criteria/60016"
        }
    ],
    "technicalCriteria": [
        {
            "id": 66062,
            "name": "Secure Coding - Input Validation",
            "weight": 6,
            "critical": false
        }
    ],
    "technologies": [
        {
            "id": 1520000,
            "name": "Siebel",
            "href": "AIP/technologies/1520000"
        }
    ],
    "qualityStandards": [
        
    ],
    "parameters": [
        
    ],
    "thresholds": [
        60.0,
        80.0,
        95.0,
        100.0
    ]
}
